# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],         # 0-P1/2     0
   [-1, 1, Conv, [128, 3, 2]],           # 1-P2/4     1
   [-1, 3, C3, [128]],                   # 2          2       1      2
   [-1, 1, Conv, [256, 3, 2]],           # 3-P3/8     3
   [-1, 1, Encoder_MDCBlock1, [2]],      # 4
   [-1, 6, C3, [256]],                   # 5          4       2      4
   [-1, 1, Conv, [512, 3, 2]],           # 6-P4/16    5
   [-1, 1, Encoder_MDCBlock1, [3]],      # 7
   [-1, 9, C3, [512]],                   # 8          6       3      6
   [-1, 1, Conv, [1024, 3, 2]],          # 9-P5/32   7
   [-1, 3, C3, [1024]],                  # 10         8       1      2
   [-1, 1, SPPF, [1024, 5]],             # 11         9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 12  10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 13  11
   [[-1, 8], 1, Concat, [1]],                   # 14  12 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 15  13  SOS

   [-1, 1, Conv, [256, 1, 1]],                  # 16  14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 17  15
   [[-1, 5], 1, Concat, [1]],                   # 18  16 cat backbone P3
   [-1, 3, C3, [256, False,]],                  # 19  17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                  # 20  18
   [[-1, 16], 1, Concat, [1]],                  # 21  19 cat head P4
   [-1, 3, C3, [512, False]],                   # 22  20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                  # 23  21
   [[-1, 12], 1, Concat, [1]],                  # 24  22 cat head P5
   [-1, 3, C3, [1024, False]],                  # 25  23 (P5/32-large)

   [[19, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
