# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvLayer, [32, 11, 1]], # 0
   [-1, 1, Res, [32, 2]], # 1
   [-1, 1, ConvLayer, [64, 3, 2]], # 2
   [-1, 1, Res, [64, 2]], # 3
   [-1, 1, ConvLayer, [128, 3, 2]], # 4
   [-1, 1, Res, [128, 2]], # 5
   [-1, 1, ConvLayer, [256, 3, 2]], # 6
   [-1, 1, Res, [256, 4]], # 7
   [-1, 1, UpsampleConvLayer, [128, 3, 2]], # 8
   [[-1, 5], 1, Add, [1]], # 9
   [[-1, 8], 1, Res2, [128, 2]], # 10
   [-1, 1, UpsampleConvLayer, [64, 3, 2]], # 11
   [[-1, 3], 1, Add, [1]], # 12
   [[-1, 11], 1, Res2, [64, 2]], # 13
   [-1, 1, UpsampleConvLayer, [32, 3, 2]], # 14
   [[-1, 1], 1, Add, [1]], # 15
   [[-1, 14], 1, Res2, [32, 2]], # 16
   [-1, 1, ConvLayer, [6, 3, 1]],  # 17
   [-1, 1, Conv, [64, 6, 2, 2]],  # 18-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 19-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 21-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 23-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 25-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 27
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 28
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 24], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 31

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 22], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 35 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 32], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 38 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 28], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 41 (P5/32-large)

   [[35, 38, 41], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]