# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],         # 0-P1/2     0
   [-1, 1, Conv, [128, 3, 2]],           # 1-P2/4     1
   [-1, 3, C3, [128]],                   # 2 3          2
   [-1, 1, Conv, [256, 3, 2]],           # 3 4-P3/8     3
   [-1, 6, C3, [256]],                   # 4 6          4
   [-1, 1, Conv, [512, 3, 2]],           # 5 7-P4/16    5
   [-1, 9, C3, [512]],                   # 6 9          6
   [-1, 1, Conv, [1024, 3, 2]],          # 7 10-P5/32   7
   [-1, 3, C3, [1024]],                  # 8 12         8
   [-1, 1, SPPF, [1024, 5]],             # 9 13         9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 10 14  10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11 15  11
   [[-1, 6], 1, Concat, [1]],                   # 12 16  12 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 13 17  13  SOS
   [-1, 1, Decoder_MDCBlock1, [2]],             # 14 18

   [-1, 1, Conv, [256, 1, 1]],                  # 15 19  14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 16 20  15
   [[-1, 4], 1, Concat, [1]],                   # 17 21  16 cat backbone P3
   [-1, 3, C3, [256, False]],                   # 18 22  17 (P3/8-small)
   [-1, 1, Decoder_MDCBlock1, [3]],             # 19 23

   [-1, 1, Conv, [256, 3, 2]],                  # 20 24  18
   [[-1, 15], 1, Concat, [1]],                  # 21 25  19 cat head P4
   [-1, 3, C3, [512, False]],                   # 22 26  20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                  # 23 27  21
   [[-1, 10], 1, Concat, [1]],                  # 24 28  22 cat head P5
   [-1, 3, C3, [1024, False]],                  # 25 29  23 (P5/32-large)

   [[18, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
