# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 60  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],                 # 0-P1/2
    [ -1, 1, InvertedResidual, [ 32, 1, 1 ] ],   # 1        320x320*16
    [ -1, 1, InvertedResidual, [ 48, 2, 6 ] ],   # 2-P2/4   160x160*24
    [ -1, 1, InvertedResidual, [ 48, 1, 6 ] ],   # 3-P2/4   160x160*24
    [ -1, 1, InvertedResidual, [ 64, 2, 6 ] ],   # 4-P3/8   80x80*32
    [ -1, 1, InvertedResidual, [ 64, 1, 6 ] ],   # 5-P3/8   80x80*32
    [ -1, 1, InvertedResidual, [ 64, 1, 6 ] ],   # 6-P3/8   80x80*32
    [ -1, 1, InvertedResidual, [ 128, 2, 6 ] ],  # 7-P4/16  40x40*64
    [ -1, 1, InvertedResidual, [ 128, 1, 6 ] ],  # 8-P4/16  40x40*64
    [ -1, 1, InvertedResidual, [ 128, 1, 6 ] ],  # 9-P4/16  40x40*64
    [ -1, 1, InvertedResidual, [ 128, 1, 6 ] ],  # 10-P4/16 40x40*64
    [ -1, 1, InvertedResidual, [ 192, 1, 6 ] ],  # 11       40X40*96
    [ -1, 1, InvertedResidual, [ 192, 1, 6 ] ],  # 12       40X40*96
    [ -1, 1, InvertedResidual, [ 192, 1, 6 ] ],  # 13       40X40*96
    [ -1, 1, InvertedResidual, [ 320, 2, 6 ] ],  # 14-P5/32  20X20*160
    [ -1, 1, InvertedResidual, [ 320, 1, 6 ] ],  # 15-P5/32  20X20*160
    [ -1, 1, InvertedResidual, [ 320, 1, 6 ] ],  # 16-P5/32  20X20*160
    [ -1, 1, InvertedResidual, [ 640, 1, 6 ] ],  # 17       20X20*320
    [ -1, 1, SPPF, [1024, 5]],                   # 18
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],    # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 20
   [[-1, 10], 1, Concat, [1]],    # 21 cat backbone P4
   [-1, 3, C3, [512, False]],     # 22

   [-1, 1, Conv, [256, 1, 1]],    # 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 24
   [[-1, 6], 1, Concat, [1]],     # 25 cat backbone P3
   [-1, 3, C3, [256, False]],     # 26 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],    # 27
   [[-1, 13], 1, Concat, [1]],    # 28 cat head P4
   [-1, 3, C3, [512, False]],     # 29 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],    # 30
   [[-1, 19], 1, Concat, [1]],    # 31 cat head P5
   [-1, 3, C3, [1024, False]],    # 32 (P5/32-large)

   [[26, 29, 32], 1, Detect, [nc, anchors]],  # 33 Detect(P3, P4, P5)
  ]
